ka2_2024/src/InformationRegisters/НастройкиСервисаКабинетСотрудника/НастройкиСервисаКабинетСотрудника.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>НастройкиСервисаКабинетСотрудника</name>
  <resources>
    <name>АдресПриложения</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <resources>
    <name>Идентификатор</name>
    <comment>Идентификатор информационной системы в сервисе</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Наименование</name>
    <comment>Наименования информационной системы в сервисе</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ИдентификаторПриложения</name>
    <comment>Идентификатор приложения в сервисе, в котором развернута информационная система</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>НаименованиеПриложения</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </resources>
  <resources>
    <name>ВыполнятьРегламентноеЗадание</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>УдалитьАбонентСервисаИнициализирован</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>УдалитьТребуетсяАктивацияТестовогоТарифа</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>УдалитьТестовыйТарифАктивирован</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>УдалитьСообщениеОбАктивацииТестовогоТарифаОтправлено</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>СервисЗаблокирован</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ВерсияПриложения</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ТребуетсяОбновитьНастройкиФункциональности</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>АдресПриложенияПоИмени</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <resources>
    <name>АдресПриложенияПоИмениДоступен</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ВерсияDTO</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ВерсияAPI</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>УдалитьОбновитьУровеньДоступаКИ</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
</mdclass:InformationRegister>

ka2_2024/src/InformationRegisters/СостояниеОтложенногоПодключенияКСервису/СостояниеОтложенногоПодключенияКСервису.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СостояниеОтложенногоПодключенияКСервису</name>
  <resources>
    <name>ИдентификаторПриложения</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>7</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Состояние</name>
    <type>
      <types>EnumRef.СостоянияПодключенияКабинетСотрудника</types>
    </type>
  </resources>
  <resources>
    <name>СсылкаДляАдминистратора</name>
    <type>
      <types>String</types>
    </type>
  </resources>
</mdclass:InformationRegister>

ka2_2024/src/InformationRegisters/НастройкиСервисаКабинетСотрудника/RecordSetModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ, Замещение)
	
	Если ЗарплатаКадры.ОтключитьБизнесЛогикуПриЗаписи(ЭтотОбъект) Тогда
		Возврат;
	КонецЕсли;

	Настройки = РегистрыСведений.НастройкиСервисаКабинетСотрудника.НастройкиСервиса();
	ЭтотОбъект.ДополнительныеСвойства.Вставить("ТекущийОтветственный", Настройки.Ответственный);
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ, Замещение)
	
	Если ЗарплатаКадры.ОтключитьБизнесЛогикуПриЗаписи(ЭтотОбъект) Тогда
		Возврат;
	КонецЕсли;
	
	Если Количество() = 0 Тогда
		Если Константы.ИспользуетсяСервисКабинетСотрудника.Получить() Тогда
			Константы.ИспользуетсяСервисКабинетСотрудника.Установить(Ложь);
		КонецЕсли;
	Иначе
		
		СостояниеПодключения = РегистрыСведений.СостояниеОтложенногоПодключенияКСервису.СостояниеПодключенияКСервису();
		Если Не ЗначениеЗаполнено(СостояниеПодключения.Состояние) Тогда
			// Значение константы ИспользуетсяСервисКабинетСотрудника устанавливаем только если это не отложенное
			// подключение к сервису.
			ИспользуетсяСервис = ЗначениеЗаполнено(ЭтотОбъект[0].АдресПриложения) И ЗначениеЗаполнено(ЭтотОбъект[0].Идентификатор);
			Если ИспользуетсяСервис <> Константы.ИспользуетсяСервисКабинетСотрудника.Получить() Тогда
				Константы.ИспользуетсяСервисКабинетСотрудника.Установить(ИспользуетсяСервис);
			КонецЕсли;
		КонецЕсли;
		
		НовыйОтветственный = ЭтотОбъект[0].Ответственный;
		ТекущийОтветственный = Неопределено;
		ЭтотОбъект.ДополнительныеСвойства.Свойство("ТекущийОтветственный", ТекущийОтветственный);
		Если ТекущийОтветственный <> НовыйОтветственный Тогда
			РегистрыСведений.ИсключенияИзПравилПубликацииКабинетСотрудника.ЗарегистрироватьОтветственного(ТекущийОтветственный, НовыйОтветственный);
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.'");
#КонецЕсли
